## Initialization
I will start by initializating the libraries and variables that I will need through this exercise

In [1]:
import cx_Oracle

In [2]:
# Load ipython-sql extension
%load_ext sql

In [3]:
# Turn off connection echo
%config SqlMagic.displaycon = False

In [4]:
# Set auto-commit to True
%config SqlMagic.autocommit=True

In [5]:
# Disable feedback
%config SqlMagic.feedback=False

In [6]:
# Display short errors
%config SqlMagic.short_errors=True

In [7]:
# Import the oracle database credentials
from db_credentials import set_oracle_credentials

In [8]:
# Set connection string variables
# Set the Oracle database credentials
db = set_oracle_credentials()
hostname = db.hostname
username = db.username
password = db.password
port = db.port
service_name = db.service_name

# Build the connection string: postgresql://username:password@host:port/database
conn_string = "oracle+cx_oracle://{}:{}@{}:{}/?service_name={}" \
                        .format(username, password, hostname, port, service_name)

In [9]:
# connect to the database using the connection string
%sql $conn_string

In [10]:
# Establish a connection with the Oracle database
dsn_tns = cx_Oracle.makedsn(
    hostname, 
    port, 
    service_name= service_name
)
connection = cx_Oracle.connect(
    user = username, 
    password = password, 
    dsn = dsn_tns
) 

# Create a cursor to execute the queries
cursor = connection.cursor()

## Create Tables
Now, I will create the 3 tables that I will need through this exercise:
* master
* recharge
* product_subscription

### Master Table

First, let's drop the table if it exists to get a fresh start each time I run this notebook

In [11]:
try:
    cursor.execute("DROP TABLE master_table")
except Exception as e:
    print(e)

Now, let's create the table

In [12]:
query = """
CREATE TABLE master_table 
(
    Year_Num NUMBER,
    Month_Num NUMBER,
    Decile NUMBER,
    Subscription_Id NUMBER,
    Activation_Dt DATE,
    Revenue NUMBER
)
"""

try:
    cursor.execute(query)
except Exception as e:
    print(e)

Let's insert the sample data

In [13]:
# Set the INSERT query 
query = """INSERT INTO master_table
    (
        Year_Num,
        Month_Num,
        Decile, 
        Subscription_Id,
        Activation_Dt, 
        Revenue
    )
    VALUES 
    (
        :1, :2, :3, :4, (TO_DATE(:5, 'dd/mm/yyyy')), :6
    )
"""

cursor.execute(query, (2017, 4, 10, 36231390, "27/07/2008", 0)) 
cursor.execute(query, (2017, 4, 10, 160022446, "01/01/2017", 0)) 
cursor.execute(query, (2017, 4, 1, 105223726, "22/11/2012", 95.16)) 
cursor.execute(query, (2017, 4, 10, 138931807, "05/09/2014", 0)) 
cursor.execute(query, (2017, 4, 10, 163442138, "12/01/2017", 0)) 
cursor.execute(query, (2017, 4, 10, 137913861, "22/11/2014", 0)) 
cursor.execute(query, (2017, 4, 10, 12839765, "08/08/2007", 0)) 
cursor.execute(query, (2017, 4, 6, 93967929, "15/06/2012", 9.27)) 
cursor.execute(query, (2017, 4, 5, 25639532, "15/01/2007", 10.93)) 
cursor.execute(query, (2017, 4, 5, 161188683, "12/10/2016", 13.56)) 

# commit the transaction
connection.commit()

In [14]:
%%sql
SELECT 
    year_num,
    month_num,
    decile,
    subscription_id,
    TO_CHAR(activation_dt, 'dd/mm/yyyy') AS activation_dt,
    revenue
FROM master_table

[(2017, 4, 10, 36231390, '27/07/2008', 0),
 (2017, 4, 10, 160022446, '01/01/2017', 0),
 (2017, 4, 1, 105223726, '22/11/2012', Decimal('95.16')),
 (2017, 4, 10, 138931807, '05/09/2014', 0),
 (2017, 4, 10, 163442138, '12/01/2017', 0),
 (2017, 4, 10, 137913861, '22/11/2014', 0),
 (2017, 4, 10, 12839765, '08/08/2007', 0),
 (2017, 4, 6, 93967929, '15/06/2012', Decimal('9.27')),
 (2017, 4, 5, 25639532, '15/01/2007', Decimal('10.93')),
 (2017, 4, 5, 161188683, '12/10/2016', Decimal('13.56'))]

### Recharge Table

First, let's drop the table if it exists to get a fresh start each time I run this notebook

In [15]:
try:
    cursor.execute("DROP TABLE recharge_table")
except Exception as e:
    print(e)

Now, let's create the table

In [16]:
query = """
CREATE TABLE recharge_table 
(
    Subscription_Id NUMBER,
    Recharge_Dt DATE,
    Recharge_Value NUMBER
)
"""

try:
    cursor.execute(query)
except Exception as e:
    print(e)

Let's insert the sample data

In [17]:
# Set the INSERT query 
query = """INSERT INTO recharge_table
    (
        Subscription_Id,
        Recharge_Dt, 
        Recharge_Value
    )
    VALUES 
    (
        :1, (TO_DATE(:2, 'dd/mm/yyyy')), :3
    )
"""

cursor.execute(query, (105223726, "07/05/2017", 10))
cursor.execute(query, (138931807, "10/05/2017", 1))
cursor.execute(query, (163442138, "11/03/2017", 4))
cursor.execute(query, (137913861, "03/04/2017", 0.5))
cursor.execute(query, (93967929, "16/04/2017", 5))
cursor.execute(query, (25639532, "29/04/2017", 9.09))
cursor.execute(query, (161188683, "22/04/2017", 17))
cursor.execute(query, (105223726, "29/04/2017", 10))
cursor.execute(query, (138931807, "19/04/2017", 0.5))
cursor.execute(query, (137913861, "22/04/2017", 0.5))
cursor.execute(query, (93967929, "19/04/2017", 10))
cursor.execute(query, (105223726, "18/04/2017", 10))
cursor.execute(query, (137913861, "28/04/2017", 0.5))
cursor.execute(query, (105223726, "05/04/2017", 10))
cursor.execute(query, (105223726, "25/04/2017", 10))
cursor.execute(query, (105223726, "15/04/2017", 10))
cursor.execute(query, (105223726, "02/04/2017", 10))
cursor.execute(query, (105223726, "20/03/2017", 10))

# commit the transaction
connection.commit()

In [18]:
%%sql
SELECT 
    subscription_id,
    TO_CHAR(recharge_dt, 'dd/mm/yyyy') AS activation_dt,
    recharge_value
FROM recharge_table

[(105223726, '07/05/2017', 10),
 (138931807, '10/05/2017', 1),
 (163442138, '11/03/2017', 4),
 (137913861, '03/04/2017', Decimal('0.5')),
 (93967929, '16/04/2017', 5),
 (25639532, '29/04/2017', Decimal('9.09')),
 (161188683, '22/04/2017', 17),
 (105223726, '29/04/2017', 10),
 (138931807, '19/04/2017', Decimal('0.5')),
 (137913861, '22/04/2017', Decimal('0.5')),
 (93967929, '19/04/2017', 10),
 (105223726, '18/04/2017', 10),
 (137913861, '28/04/2017', Decimal('0.5')),
 (105223726, '05/04/2017', 10),
 (105223726, '25/04/2017', 10),
 (105223726, '15/04/2017', 10),
 (105223726, '02/04/2017', 10),
 (105223726, '20/03/2017', 10)]

**1- Get the customers that activated after year 2013.  
Show Year_Num , Month_Num ,Subscription_Id , Activation_Dt and Revenue.**

In [19]:
%%sql
SELECT 
    year_num,
    month_num,
    subscription_id,
    TO_CHAR(activation_dt, 'dd/mm/yyyy') AS activation_dt,
    revenue
FROM master_table
WHERE EXTRACT(YEAR FROM activation_dt) > 2013

[(2017, 4, 160022446, '01/01/2017', 0),
 (2017, 4, 138931807, '05/09/2014', 0),
 (2017, 4, 163442138, '12/01/2017', 0),
 (2017, 4, 137913861, '22/11/2014', 0),
 (2017, 4, 161188683, '12/10/2016', Decimal('13.56'))]

**2-Get the recharges transactions with recharge value greater than 5LE.  
Show Subscription_Id , Recharge_Dt and Recharge_Value.**

In [20]:
%%sql
SELECT
    Subscription_Id, 
    TO_CHAR(Recharge_Dt, 'dd/mm/yyyy') AS Recharge_Dt,
    Recharge_Value
FROM recharge_table
WHERE Recharge_Value > 5

[(105223726, '07/05/2017', 10),
 (25639532, '29/04/2017', Decimal('9.09')),
 (161188683, '22/04/2017', 17),
 (105223726, '29/04/2017', 10),
 (93967929, '19/04/2017', 10),
 (105223726, '18/04/2017', 10),
 (105223726, '05/04/2017', 10),
 (105223726, '25/04/2017', 10),
 (105223726, '15/04/2017', 10),
 (105223726, '02/04/2017', 10),
 (105223726, '20/03/2017', 10)]

**3- Get the customers with their total recharge value during April ; considering that the total recharges is at least 15LE during the same month.    
Show the Subscription_ID and Total Recharges Value.**

In [21]:
%%sql
SELECT
    subscription_id,
    sum(recharge_value) as total_recharges
FROM recharge_table
WHERE EXTRACT(MONTH FROM recharge_dt) = 4
GROUP BY subscription_id
HAVING sum(recharge_value) >= 15

[(105223726, 60), (93967929, 15), (161188683, 17)]

**4- Get the recharge transactions for customers with revenue less than 50LE.  
Show Subscription_ID , Recharge_Dt and Recharge_Value**

In [22]:
%%sql
SELECT 
    m.subscription_id,
    TO_CHAR(r.recharge_dt, 'dd/mm/yyyy') AS recharge_dt,
    r.recharge_value
FROM master_table m 
JOIN recharge_table r 
    ON m.subscription_id = r.subscription_id
WHERE m.revenue < 50

[(138931807, '10/05/2017', 1),
 (163442138, '11/03/2017', 4),
 (137913861, '03/04/2017', Decimal('0.5')),
 (93967929, '16/04/2017', 5),
 (25639532, '29/04/2017', Decimal('9.09')),
 (161188683, '22/04/2017', 17),
 (138931807, '19/04/2017', Decimal('0.5')),
 (137913861, '22/04/2017', Decimal('0.5')),
 (93967929, '19/04/2017', 10),
 (137913861, '28/04/2017', Decimal('0.5'))]

**5- Get all the customers revenue and the total recharge value during April as presented in the following table.   
Show all customers even if the customer didn’t make any recharges.**

In [23]:
%%sql
SELECT 
    m.year_num,
    m.month_num,
    r.subscription_id,
    m.revenue,
    sum(r.recharge_value) AS total_recharge
FROM master_table m
JOIN recharge_table r 
    ON m.subscription_id = r.subscription_id
    AND EXTRACT(MONTH FROM r.recharge_dt) = 4
GROUP BY m.year_num, m.month_num, r.subscription_id, m.revenue

[(2017, 4, 25639532, Decimal('10.93'), Decimal('9.09')),
 (2017, 4, 161188683, Decimal('13.56'), 17),
 (2017, 4, 138931807, 0, Decimal('0.5')),
 (2017, 4, 105223726, Decimal('95.16'), 60),
 (2017, 4, 137913861, 0, Decimal('1.5')),
 (2017, 4, 93967929, Decimal('9.27'), 15)]

**6- Get the Count of unique Subscription, Total Revenue and Total Recharges per Year_num, Month_num and Decile.**

In [24]:
%%sql
SELECT
    m.year_num,
    m.month_num,
    m.decile,
    COUNT(DISTINCT m.subscription_id) AS "No_Of_Subs",
    SUM(m.revenue) AS total_revenue,
    SUM(r.recharge_value) AS total_recharges
FROM master_table m
JOIN recharge_table r 
    ON m.subscription_id = r.subscription_id
GROUP BY m.year_num, m.month_num, m.decile

[(2017, 4, 5, 2, Decimal('24.49'), Decimal('26.09')),
 (2017, 4, 10, 3, 0, 7),
 (2017, 4, 6, 1, Decimal('18.54'), 15),
 (2017, 4, 1, 1, Decimal('761.28'), 80)]

**7- Get the last recharge transaction value for each customer.   
Show Subscription_Id, Recharge_Dt and Recharge_Value**

In [25]:
%%sql
select t.Subscription_Id, t.Recharge_Dt, t.Recharge_Value
from recharge_table t
inner join (
    select Subscription_Id, max(Recharge_Dt) as MaxDate
    from recharge_table
    group by Subscription_Id
) tm on t.Subscription_Id = tm.Subscription_Id and t.Recharge_Dt = tm.MaxDate

[(163442138, datetime.datetime(2017, 3, 11, 0, 0), 4),
 (105223726, datetime.datetime(2017, 5, 7, 0, 0), 10),
 (138931807, datetime.datetime(2017, 5, 10, 0, 0), 1),
 (137913861, datetime.datetime(2017, 4, 28, 0, 0), Decimal('0.5')),
 (93967929, datetime.datetime(2017, 4, 19, 0, 0), 10),
 (161188683, datetime.datetime(2017, 4, 22, 0, 0), 17),
 (25639532, datetime.datetime(2017, 4, 29, 0, 0), Decimal('9.09'))]

**8- Get the last three recharge transactions value for each customer.   
Show Subscription_Id, Recharge_Dt and Recharge_Value**